Museum/Documents/СписаниеЭкспонатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеЭкспонатов</Name>
			<Comment>+</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Экспонаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Museum/InformationRegisters/ИсторияСписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСписания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЭкспонатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Экспонат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Museum/Enums/СтатусыЭкспонатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыЭкспонатов</Name>
			<Comment>+</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВНаличии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСписанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Museum/Catalogs/Экспонаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Экспонаты</Name>
			<Comment>+</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Коллекции</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодСоздания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сохранность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сохранность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыеУсловияХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЭкспонатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Залы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЭкспонатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Museum/Documents/СписаниеЭкспонатов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда		
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КонецЕсли;
	
	История = РегистрыСведений.ИсторияСписания.СоздатьНаборЗаписей();        
	НачатьТранзакцию();
	Для Каждого Актив Из ТекущийОбъект.Экспонаты Цикл
		Экспонаты = Актив.Наименование.ПолучитьОбъект();
		Экспонаты.Статус = Перечисления.СтатусыЭкспонатов.Списано;
		Экспонаты.Записать();   
		
		История.Прочитать();
		ЗаписьИстории = История.Добавить();
		ЗаписьИстории.Период = Объект.Дата;
		ЗаписьИстории.Экспонат = Экспонаты.Ссылка;
		ЗаписьИстории.Идентификатор = Экспонаты.Код; 
		//ЗаписьИстории.Местоположение = Экспонаты.Местоположение;
		ЗаписьИстории.ОтветственноеЛицо = Экспонаты.ОтветственноеЛицо;  
		ЗаписьИстории.Статус = Экспонаты.Статус; 
		ЗаписьИстории.Основание = ТекущийОбъект.Основание;  
		История.Записать();
	КонецЦикла;             
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспонатыНаименованиеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Экспонаты.ТекущиеДанные;
	СтрокаТабличнойЧасти.Идентификатор = ПолучитьИдентификаторТК(СтрокаТабличнойЧасти.Наименование);
КонецПроцедуры

Функция ПолучитьИдентификаторТК(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Экспонаты.Код КАК Код
	|ИЗ
	|	Справочник.Экспонаты КАК Экспонаты
	|ГДЕ
	|	Экспонаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Код;
	КонецЦикла;
КонецФункции

//Файлы
&НаКлиенте
Процедура Загрузить(Команда)
	Диалог = новый ПараметрыДиалогаПомещенияФайлов("Выберите файл для загрузки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалога", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалога(ОписаниеФайла, ДопПараметры) Экспорт
	Попытка
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли; 
	
	АдресВХранилище = ОписаниеФайла.Адрес;
	Объект.ИмяФайла = ОписаниеФайла.СсылкаНаФайл.Файл.Имя;
	
	Модифицированность = Истина;
	Исключение        
	    Предупреждение("Форма выбора файла была закрыта. Файл не выбран.");
	КонецПопытки;
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)
	Попытка
		СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
		ПолучитьФайл(СсылкаНаФайлВИБ,Объект.ИмяФайла);
	Исключение
		Предупреждение("Перед тем как скачивать файл, его нужно загрузить! Если же вы попытались открыть или скачать только что загруженый файл, то его перед этим нужно сохранить, нажав кнопку 'Провести и закрыть'.");
	КонецПопытки;
КонецПроцедуры
